Revit 2024 API
StructuralSectionRound.Diameter Property
 Pipe Diameter.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public double Diameter { get; set; }
Visual Basic
Public Property Diameter As Double
	Get
	Set
Visual C++
public:
property double Diameter {
	double get ();
	void set (double value);
}
See Also
StructuralSectionRound Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace